In [3]:
import pandas as pd
import numpy as np

In [4]:
dict1={'names':['aravind','samar',np.nan,'siri'],
       'age':[np.nan,21,32,43],
       'city':['hyd','blr','chenni',np.nan]}
dict1

{'names': ['aravind', 'samar', nan, 'siri'],
 'age': [nan, 21, 32, 43],
 'city': ['hyd', 'blr', 'chenni', nan]}

In [6]:
d1=pd.DataFrame(dict1)

In [7]:
d1.dtypes

names     object
age      float64
city      object
dtype: object

In [9]:
dict2={'names':['aravind','samar',None,'siri'],
       'age':[np.nan,21,32,43],
       'city':['hyd','blr','chenni',None]}
pd.DataFrame(dict2)

     names   age    city
0  aravind   NaN     hyd
1    samar  21.0     blr
2     None  32.0  chenni
3     siri  43.0    None

In [10]:
d1.isnull()

   names    age   city
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [13]:
d1.isnull().sum()

names    1
age      1
city     1
dtype: int64

In [12]:
d1.isnull().sum()*100/len(d1)

names    25.0
age      25.0
city     25.0
dtype: float64

- np.nan: not a number this appilcabel for numerical columns only

- np.nan:not a number this applicable for numerical column only

- generally data has some empty rows

- it is a data problem

- if you read that kind of data you will see Null

- You need to understand it is a data corrupted or really a null values are there

**method**
- fill the some random value

In [14]:
d1.fillna(40)

     names   age    city
0  aravind  40.0     hyd
1    samar  21.0     blr
2       40  32.0  chenni
3     siri  43.0      40

**method-2**
- we can fill the values w.r.t columns also

In [16]:
d1['age'].fillna(40)
# it will not update
# inplace=false

0    40.0
1    21.0
2    32.0
3    43.0
Name: age, dtype: float64

In [17]:
d1

     names   age    city
0  aravind   NaN     hyd
1    samar  21.0     blr
2      NaN  32.0  chenni
3     siri  43.0     NaN

In [19]:
d1['age'].fillna(40,inplace=True)

In [20]:
d1

     names   age    city
0  aravind  40.0     hyd
1    samar  21.0     blr
2      NaN  32.0  chenni
3     siri  43.0     NaN

In [21]:
d1['city'].fillna(40,inplace=True)

In [22]:
d1

     names   age    city
0  aravind  40.0     hyd
1    samar  21.0     blr
2      NaN  32.0  chenni
3     siri  43.0      40

In [23]:
dict1={'names':['aravind','samar',np.nan,'siri'],
       'age':[np.nan,21,32,43],
       'city':['hyd','blr','chenni',np.nan]}
d1=pd.DataFrame(dict1)

In [24]:
d1

     names   age    city
0  aravind   NaN     hyd
1    samar  21.0     blr
2      NaN  32.0  chenni
3     siri  43.0     NaN

In [ ]:
**me

In [31]:
d1.fillna(method='bfill')

C:\Users\HP\AppData\Local\Temp\ipykernel_14132\1914124427.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

     names   age    city
0  aravind  21.0     hyd
1    samar  21.0     blr
2     siri  32.0  chenni
3     siri  43.0     NaN

In [29]:
d1.fillna(method='bfill',axis=1)
# column1: names index is missing values it is filled with index 4 value
# column2: age index 1 is missing values it is filled with index 2 value
# column3:

C:\Users\HP\AppData\Local\Temp\ipykernel_14132\4273752401.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

     names   age    city
0  aravind   hyd     hyd
1    samar  21.0     blr
2     32.0  32.0  chenni
3     siri  43.0     NaN

In [30]:
d1

     names   age    city
0  aravind   NaN     hyd
1    samar  21.0     blr
2      NaN  32.0  chenni
3     siri  43.0     NaN

In [26]:
d1.fillna(method='ffill')

C:\Users\HP\AppData\Local\Temp\ipykernel_14132\4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

     names   age    city
0  aravind   NaN     hyd
1    samar  21.0     blr
2    samar  32.0  chenni
3     siri  43.0  chenni

In [27]:
d1.fillna(method='pad')

C:\Users\HP\AppData\Local\Temp\ipykernel_14132\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

     names   age    city
0  aravind   NaN     hyd
1    samar  21.0     blr
2    samar  32.0  chenni
3     siri  43.0  chenni

- backfill and bill fill with next value 
- pad and ffill fill with previous value
- but it will change based on axis

In [28]:
d1.fillna(method='backfill')

C:\Users\HP\AppData\Local\Temp\ipykernel_14132\907203477.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill')

     names   age    city
0  aravind  21.0     hyd
1    samar  21.0     blr
2     siri  32.0  chenni
3     siri  43.0     NaN

In [ ]:
**method-4**
- mean
     - numerical values can fill with mean value
     - but mean affect by outliers
     - if we dont have outliers it is best one 
-median na
     - numarical values can fill with median value 
     - we konw that medain value deose not affect with outliers
     -

In [ ]:
dict1={'names':['aravind','samar',np.nan,'siri'],
       'age':[np.nan,21,32,43],
       'city':['hyd','lr','chenni',np.nan]}
d1=pd.DataFrame(dict1)

In [33]:
# we al
# d1.fillna(<random_number>)

age_mean=d1['age'].mean()
d1['age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: age, dtype: float64

In [39]:
age_median=d1['age'].median()
d1['age'].fillna(age_median)

0    32.0
1    21.0
2    32.0
3    43.0
Name: age, dtype: float64

In [40]:
d1['city'].mode()

0       blr
1    chenni
2       hyd
Name: city, dtype: object

In [ ]:
- fill with random value
- fill with random value on

In [ ]:
**method-5**
**KNN imputer**
- KNN: k neartest neighbours
- k is a hyper parameter means user can choose
- it is distance metric: **Euclidian disatnce**
- KNN imputer will take the mean of the neig

In [42]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['age']])

array([[32.],
       [21.],
       [32.],
       [43.]])